Revit 2024 API
RebarBarType.DeformationType Property
 Defines bar deformation type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public RebarDeformationType DeformationType { get; set; }
Visual Basic
Public Property DeformationType As RebarDeformationType
	Get
	Set
Visual C++
public:
property RebarDeformationType DeformationType {
	RebarDeformationType get ();
	void set (RebarDeformationType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace